DELETE FROM
    logs;

INSERT INTO
    logs (
        datetime,
        user_id,
        post_id,
        space_type_id,
        event_type_id
    )
VALUES
    ('2024-02-19 12:00:00', 2, NULL, 1, 1),     --user2 вошел
    ('2024-02-19 12:10:00', 2, 5, 2, 3),        --user2 создал пост
    ('2024-02-19 12:10:00', 2, NULL, 1, 5),     --user2 вышел
    ('2024-02-20 12:00:00', 1, NULL, 1, 1),     --user1 вошел
    ('2024-02-20 12:05:00', 1, 5, 3, 2),        --user1 прокомментировал пост 5
    ('2024-02-20 12:06:00', 1, 5, 3, 2),        --user1 прокомментировал пост 5
    ('2024-02-20 12:15:00', 1, 1, 2, 3),        --user1 создал пост
    ('2024-02-20 12:25:00', 1, 2, 2, 3),        --user1 создал пост
    ('2024-02-20 12:35:00', 1, 3, 2, 3),        --user1 создал пост
    ('2024-02-20 12:45:00', 1, 4, 2, 3),        --user1 создал пост
    ('2024-02-20 12:06:00', 1, 1, 3, 2),        --user1 прокомментировал пост 1
    ('2024-02-20 12:10:00', 1, NULL, 1, 5),     --user1 вышел
    ('2024-02-21 12:00:00', 2, NULL, 1, 1),     --user2 вошел
    ('2024-02-21 12:05:00', 2, 1, 3, 2),        --user2 прокомментировал пост 1
    ('2024-02-21 12:10:00', 2, NULL, 1, 5),     --user2 вышел
    ('2024-02-22 12:00:00', 1, NULL, 1, 1),     --user1 вошел
    ('2024-02-22 12:10:00', 1, NULL, 1, 5),     --user1 вышел
    ('2024-02-22 18:00:00', 1, NULL, 1, 1),     --user1 вошел
    ('2024-02-22 18:20:00', 1, NULL, 1, 5);     --user1 вышел